backend/classes_MonProjet.dot
digraph "classes_MonProjet" {
rankdir=BT
charset="utf-8"
"api.management.commands.firebase_push_claims.Command" [color="black", fontcolor="black", label=<{Command|help : str<br ALIGN="LEFT"/>|add_arguments(parser)<br ALIGN="LEFT"/>handle()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.admin.CustomUserAdmin" [color="black", fontcolor="black", label=<{CustomUserAdmin|fieldsets : tuple<br ALIGN="LEFT"/>list_display : tuple<br ALIGN="LEFT"/>list_filter : tuple<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.auth_views.DevPromoteCoachView" [color="black", fontcolor="black", label=<{DevPromoteCoachView|authentication_classes : list<br ALIGN="LEFT"/>permission_classes : list<br ALIGN="LEFT"/>|post(request)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.authentication.FirebaseAuthentication" [color="black", fontcolor="black", label=<{FirebaseAuthentication|keyword : str<br ALIGN="LEFT"/>|authenticate(request)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.permissions.IsCoachOrStaff" [color="black", fontcolor="black", label=<{IsCoachOrStaff|allowed_roles : tuple<br ALIGN="LEFT"/>|has_permission(request, view)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.permissions.IsStaffRole" [color="black", fontcolor="black", label=<{IsStaffRole|allowed_roles : tuple<br ALIGN="LEFT"/>|has_permission(request, view)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.auth_views.MeView" [color="black", fontcolor="black", label=<{MeView|authentication_classes : list<br ALIGN="LEFT"/>permission_classes : list<br ALIGN="LEFT"/>|get(request)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.serializers.ProductSerializer.Meta" [color="black", fontcolor="black", label=<{Meta|fields : str<br ALIGN="LEFT"/>model<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.serializers.OrderSerializer.Meta" [color="black", fontcolor="black", label=<{Meta|fields : tuple<br ALIGN="LEFT"/>model<br ALIGN="LEFT"/>read_only_fields : tuple<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.serializers.TicketSerializer.Meta" [color="black", fontcolor="black", label=<{Meta|fields : tuple<br ALIGN="LEFT"/>model<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.migrations.0001_initial.Migration" [color="black", fontcolor="black", label=<{Migration|dependencies : list<br ALIGN="LEFT"/>initial : bool<br ALIGN="LEFT"/>operations : list<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.migrations.0002_order_line_items_user_firebase_uid.Migration" [color="black", fontcolor="black", label=<{Migration|dependencies : list<br ALIGN="LEFT"/>operations : list<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.models.Order" [color="black", fontcolor="black", label=<{Order|STATUS_CHOICES : tuple<br ALIGN="LEFT"/>client : ForeignKey<br ALIGN="LEFT"/>created_at : DateTimeField<br ALIGN="LEFT"/>line_items : JSONField<br ALIGN="LEFT"/>order_number : CharField<br ALIGN="LEFT"/>status : CharField<br ALIGN="LEFT"/>total : DecimalField<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.admin.OrderAdmin" [color="black", fontcolor="black", label=<{OrderAdmin|list_display : tuple<br ALIGN="LEFT"/>list_filter : tuple<br ALIGN="LEFT"/>search_fields : tuple<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.serializers.OrderSerializer" [color="black", fontcolor="black", label=<{OrderSerializer|clientId : SerializerMethodField<br ALIGN="LEFT"/>createdAt : SerializerMethodField<br ALIGN="LEFT"/>items : JSONField<br ALIGN="LEFT"/>num_commande : CharField<br ALIGN="LEFT"/>|get_clientId(obj)<br ALIGN="LEFT"/>get_createdAt(obj)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.views.OrderViewSet" [color="black", fontcolor="black", label=<{OrderViewSet|authentication_classes : list<br ALIGN="LEFT"/>permission_classes : list<br ALIGN="LEFT"/>queryset<br ALIGN="LEFT"/>serializer_class<br ALIGN="LEFT"/>|get_queryset()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.models.Product" [color="black", fontcolor="black", label=<{Product|category : CharField<br ALIGN="LEFT"/>created_at : DateTimeField<br ALIGN="LEFT"/>description : TextField<br ALIGN="LEFT"/>image_url : URLField<br ALIGN="LEFT"/>name : CharField<br ALIGN="LEFT"/>price : DecimalField<br ALIGN="LEFT"/>stock : IntegerField<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.admin.ProductAdmin" [color="black", fontcolor="black", label=<{ProductAdmin|list_display : tuple<br ALIGN="LEFT"/>list_filter : tuple<br ALIGN="LEFT"/>search_fields : tuple<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.serializers.ProductSerializer" [color="black", fontcolor="black", label=<{ProductSerializer|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.views.ProductViewSet" [color="black", fontcolor="black", label=<{ProductViewSet|authentication_classes : list<br ALIGN="LEFT"/>queryset<br ALIGN="LEFT"/>serializer_class<br ALIGN="LEFT"/>|get_permissions()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.permissions.ReadOnlyOrStaff" [color="black", fontcolor="black", label=<{ReadOnlyOrStaff|<br ALIGN="LEFT"/>|has_permission(request, view)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.models.Ticket" [color="black", fontcolor="black", label=<{Ticket|STATUS_CHOICES : tuple<br ALIGN="LEFT"/>client : ForeignKey<br ALIGN="LEFT"/>created_at : DateTimeField<br ALIGN="LEFT"/>status : CharField<br ALIGN="LEFT"/>subject : CharField<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.admin.TicketAdmin" [color="black", fontcolor="black", label=<{TicketAdmin|list_display : tuple<br ALIGN="LEFT"/>list_filter : tuple<br ALIGN="LEFT"/>search_fields : tuple<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.serializers.TicketSerializer" [color="black", fontcolor="black", label=<{TicketSerializer|clientId : SerializerMethodField<br ALIGN="LEFT"/>createdAt : DateTimeField<br ALIGN="LEFT"/>|get_clientId(obj)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.views.TicketViewSet" [color="black", fontcolor="black", label=<{TicketViewSet|authentication_classes : list<br ALIGN="LEFT"/>permission_classes : list<br ALIGN="LEFT"/>queryset<br ALIGN="LEFT"/>serializer_class<br ALIGN="LEFT"/>|get_queryset()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"api.models.User" [color="black", fontcolor="black", label=<{User|ROLE_CHOICES : tuple<br ALIGN="LEFT"/>firebase_uid : CharField<br ALIGN="LEFT"/>groups : ManyToManyField<br ALIGN="LEFT"/>phone : CharField<br ALIGN="LEFT"/>role : CharField<br ALIGN="LEFT"/>user_permissions : ManyToManyField<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"api.models.Order" -> "api.serializers.OrderSerializer.Meta" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="model", style="solid"];
"api.models.Product" -> "api.serializers.ProductSerializer.Meta" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="model", style="solid"];
"api.models.Ticket" -> "api.serializers.TicketSerializer.Meta" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="model", style="solid"];
"api.serializers.OrderSerializer" -> "api.views.OrderViewSet" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="serializer_class", style="solid"];
"api.serializers.ProductSerializer" -> "api.views.ProductViewSet" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="serializer_class", style="solid"];
"api.serializers.TicketSerializer" -> "api.views.TicketViewSet" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="serializer_class", style="solid"];
}
